package com.wotiwan;

public class App {
    public static void main(String[] args) {

        // TODO: Доделать проверку удаления заметки по id юзера // ГОТОВО
        // TODO: Сделать обработку ошибок при работе с Note's // ГОТОВО
        // TODO: Сделать пагинацию заметок // ГОТОВО
        // TODO: Добавить отображение ника пользователя в шапке // ГОТОВО
        // TODO: Добавить util класс, который будет подгружать все пути (эндпоинты) // ГОТОВО
        // TODO: Добавить util класс JspHelper, который будет готовить строку с для путей jsp файлов // ГОТОВО
        // TODO: Добавить возможность редактирования заметок // ГОТОВО

        // TODO: Написать README.md
        // TODO: Закрепить релиз 1.0 на гите

        // TODO: Перевести проект на Spring + Hibernate :DDD

    }
}
